app/controllers/cartuchos_controller.rb

SELECT "cartuchos".* FROM "cartuchos"
---
  def index
    @cartuchos = Cartucho.all

SELECT "cartuchos".* FROM "cartuchos" WHERE "cartuchos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @cartucho = Cartucho.find(params[:id])

SELECT "cartuchos".* FROM "cartuchos" WHERE "cartuchos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @cartucho = Cartucho.find(params[:id])

INSERT INTO "cartuchos" ("codigo", "created_at", "estado", "fecha_ing", "referencia", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @cartucho = Cartucho.new(params[:cartucho])

    respond_to do |format|
      if @cartucho.save

SELECT "cartuchos".* FROM "cartuchos" WHERE "cartuchos"."id" = ? LIMIT 1  [["id", "19"]]
DELETE FROM "cartuchos" WHERE "cartuchos"."id" = ?  [["id", 19]]
---
  def destroy
    @cartucho = Cartucho.find(params[:id])
    @cartucho.destroy

SELECT "cartuchos".* FROM "cartuchos" WHERE "cartuchos"."codigo" = 'dsadsa' LIMIT 1
---
  def search
    #puts "#{params[:cartucho][:codigo]}".red
    @cartucho = Cartucho.find_by_codigo(params[:cartucho][:codigo])