app/controllers/historials_controller.rb

  def edit

    @historial = Historial.find(params[:id])
---
SELECT "historials".* FROM "historials" WHERE "historials"."id" = ? LIMIT 1  [["id", "17"]]

  def create
    @historial = Historial.new(params[:historial])
    @historial.cartucho = Cartucho.find(params[:cartucho_id])


    respond_to do |format|
      if @historial.save
---
SELECT "cartuchos".* FROM "cartuchos" WHERE "cartuchos"."id" = ? LIMIT 1  [["id", "16"]]
INSERT INTO "historials" ("cantidad_toner", "cartucho_id", "created_at", "drum", "empresa", "fecha_devolucion", "fecha_fabricacion", "fecha_venta", "mag_roller", "motivo", "observaciones", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @historial = Historial.find(params[:id])

    respond_to do |format|
      if @historial.update_attributes(params[:historial])
---
SELECT "historials".* FROM "historials" WHERE "historials"."id" = ? LIMIT 1  [["id", "14"]]
UPDATE "historials" SET "motivo" = 'Garantia', "mag_roller" = 'Nuevo', "drum" = 'Usado', "updated_at" = '2013-02-14 03:51:41.804047' WHERE "historials"."id" = 14

  def destroy
    @historial = Historial.find(params[:id])
    @cartucho =@historial.cartucho
    @historial.destroy
---
SELECT "historials".* FROM "historials" WHERE "historials"."id" = ? LIMIT 1  [["id", "20"]]
DELETE FROM "historials" WHERE "historials"."id" = ?  [["id", 20]]